In [30]:
def my_sq(x):
  return x ** 2

def my_exp(x, n):
  return x ** n

In [31]:
import pandas as pd

df = pd.DataFrame({'a': [10, 20, 30], 'b': [20, 30, 40]})
print(df)

    a   b
0  10  20
1  20  30
2  30  40

In [32]:
print(df['a'] ** 2)

0    100
1    400
2    900
Name: a, dtype: int64

In [33]:
sq = df['a'].apply(my_sq)
print(sq)

0    100
1    400
2    900
Name: a, dtype: int64

In [34]:
ex = df['a'].apply(my_exp, n=3)
print(ex)

0     1000
1     8000
2    27000
Name: a, dtype: int64

In [35]:
def print_me(x):
  print(x)

In [36]:
print(df.apply(print_me, axis=0)) # 0:열 / 1:행

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64
a    None
b    None
dtype: object

In [37]:
def avg_col_apply(col):
  sum = 0

  for item in col:
    sum += item

  return sum / df.shape[0]

In [38]:
print(df.apply(avg_col_apply))

a    20.0
b    30.0
dtype: float64

In [39]:
def avg_row_apply(row):
  sum = 0

  for item in row:
    sum += item

  return sum / df.shape[1]

In [40]:
print(df.apply(avg_row_apply, axis=1))

0    15.0
1    25.0
2    35.0
dtype: float64

In [41]:
import seaborn as sns

titanic = sns.load_dataset('titanic')
print(titanic.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB
None

In [42]:
import numpy as np

def count_missing(vec):
  null_vec = pd.isnull(vec)
  null_count = np.sum(null_vec)

  return null_count

cmis_col = titanic.apply(count_missing)
print(cmis_col)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [43]:
# 누락값 비율 계산
def prop_missing(vec):
  num = count_missing(vec)
  dem = vec.size

  return num / dem

pmis_col = titanic.apply(prop_missing)
print(pmis_col)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [44]:
# 행 방향
cmis_row = titanic.apply(count_missing, axis=1)
pmis_row = titanic.apply(prop_missing, axis=1)

print(cmis_row.head())

0    1
1    0
2    1
3    0
4    1
dtype: int64

In [45]:
print(pmis_row.head())

0    0.066667
1    0.000000
2    0.066667
3    0.000000
4    0.066667
dtype: float64

In [46]:
titanic['num_missing'] = titanic.apply(count_missing, axis=1)
print(titanic.head())

   survived  pclass     sex   age  ...  embark_town  alive  alone num_missing
0         0       3    male  22.0  ...  Southampton     no  False           1
1         1       1  female  38.0  ...    Cherbourg    yes  False           0
2         1       3  female  26.0  ...  Southampton    yes   True           1
3         1       1  female  35.0  ...  Southampton    yes  False           0
4         0       3    male  35.0  ...  Southampton     no   True           1

[5 rows x 16 columns]

In [47]:
# 누락값이 1개 이상인 데이터 추출
print(titanic.loc[titanic.num_missing > 0, :].sample(10))

     survived  pclass     sex   age  ...  embark_town  alive  alone num_missing
771         0       3    male  48.0  ...  Southampton     no   True           1
408         0       3    male  21.0  ...  Southampton     no   True           1
190         1       2  female  32.0  ...  Southampton    yes   True           1
474         0       3  female  22.0  ...  Southampton     no   True           1
444         1       3    male   NaN  ...  Southampton    yes   True           2
167         0       3  female  45.0  ...  Southampton     no  False           1
633         0       1    male   NaN  ...  Southampton     no   True           2
24          0       3  female   8.0  ...  Southampton     no  False           1
168         0       1    male   NaN  ...  Southampton     no   True           2
344         0       2    male  36.0  ...  Southampton     no   True           1

[10 rows x 16 columns]